#define _CRT_SECURE_NO_WARNINGS //Підключення бібліотеки для використання scanf
#include <stdio.h>

int main()
{
    int k=1; //Починаємо з 1 тому що у любому числі мінімум 1 цифра вже є
    int n;
    printf("Vvedite n: ");
    scanf("%d", &n); //Вводимо бажане число
    
    while ((n/=10) > 0) k++; //Проводисмо ітерацію числа, наприклад якщо у нас число 1234 отримуємо: після першої ітерації у нас залишається число 123, а до k додаємо 1, далі проводиво другу ітерацію, у нас залишається 12, додаємо до k ще одну 1. Проводимо ще одну ітерація, у нас залишається 1 і ми знову додаємо до k ще одну 1. Далі не важливо скільки ще разів ми будемо повторювати ітерація, так як у нас результат буде 0, тому відповідю буде число 4.
    printf("k:%d", k); //Виводимо результат лічильника
    return 0;
}
